var getName = function () {
    var nameFirst = [
        "赵", "钱", "孙", "李", "周", "吴", "郑", "王", "冯", "陈", 
        "褚", "卫", "蒋", "沈", "韩", "杨", "朱", "秦", "尤", "许",
        "何", "吕", "施", "张", "孔", "曹", "严", "华", "金", "魏", 
        "陶", "姜", "戚", "谢", "邹", "喻", "柏", "水", "窦", "章",
        "云", "苏", "潘", "葛", "奚", "范", "彭", "郎", "鲁", "韦", 
        "昌", "马", "苗", "凤", "花", "方", "俞", "任", "袁", "柳",
        "酆", "鲍", "史", "唐", "费", "廉", "岑", "薛", "雷", "贺", 
        "倪", "汤", "滕", "殷", "罗", "毕", "郝", "邬", "安", "常",
        "乐", "于", "时", "傅", "皮", "卞", "齐", "康", "伍", "余", 
        "元", "卜", "顾", "孟", "平", "黄", "和", "穆", "萧", "尹"
    ];
    var nameSecond = [
        "子", "淼", "阳", "夫", "期", "甜", "梦", "尚", "国", "贺",
        "雪", "易", "益", "谕", "亿", "瑾", "瑾", "春", "杨", "文", 
        "东", "雄", "浩", "熙", "溶", "冰", "", "宜", "", "忆", 
        "美", "颂", "达", "知", "", "忠", "鹏", "", "慧", "新", 
        "虚", "亦", "师", "冰", "步", "逸", "禹", "淳", "泽", "伟", 
        "越", "御", "翔", "弥", "晶", "凌", "苒", "雨", "嘉", "佳", 
        "予", "可", "紫", "瑞", "昕", "品", "明", "", "泽", "章", 
        "从", "贾", "升", "门", "运", "汝", "淑", "晶", "诏", "榕", 
        "密", "家", "晓", "一", "语", "添", "添", "露", "雅", "雅", 
        "清", "诗", "封", "凯", "天", "玥", "贵", "天", "派", "若"
    ];
    var nameThird = [
        "璇", "错", "栋", "守", "堂", "甜", "敏", "尚", "贤", "祥", 
        "风", "寒", "辰", "帆", "冉", "春", "昆", "齐", "杨", "芳", 
        "东", "霖", "宝", "兰", "溶", "枫", "", "豪", "慧", "政", 
        "欣", "慧", "轩", "杰", "源", "林", "润", "汝", "嘉", "建", 
        "火", "菲", "夏", "洁", "瓜", "醉", "靖", "美", "惠", "洋", 
        "越", "丽", "翔", "华", "莹", "晶", "溪", "涵", "怡", "毅", 
        "鹰", "琪", "儿", "麟", "蕊", "招", "悠", "宜", "远", "怡", 
        "怡", "惠", "茜", "璐", "未", "鑫", "君", "滢", "莎", "汕", 
        "钰", "玉", "庆", "鸣", "晨", "池", "非", "泽", "晗", "绿", 
        "妍", "悦", "乐", "云", "赫", "傲", "昊", "日", "曼", "萌"
    ]
    var x = Math.floor(Math.random() * nameFirst.length + 1) - 1;
    var y = Math.floor(Math.random() * nameSecond.length + 1) - 1;
    var z = Math.floor(Math.random() * nameThird.length + 1) - 1;
    return nameFirst[x] + nameSecond[y] + nameThird[z];
}